MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A12C0AGV20000/mcu.h
/*******************************************************************************
* MTB_DWT Registers MTB_DWT
*   Register Definition
*******************************************************************************/
#define FM_MTB_DWT_CMP_ADDR_START                 *((volatile uint32_t*)(0xF0001000UL))
#define FM0P_MTB_DWT_CMP_ADDR_START               *((volatile uint32_t*)(0xF0001000UL))
#define FM_MTB_DWT_CMP_DATA_START                 *((volatile uint32_t*)(0xF0001004UL))
#define FM0P_MTB_DWT_CMP_DATA_START               *((volatile uint32_t*)(0xF0001004UL))
#define FM_MTB_DWT_CMP_MASK_START                 *((volatile uint32_t*)(0xF0001008UL))
#define FM0P_MTB_DWT_CMP_MASK_START               *((volatile uint32_t*)(0xF0001008UL))
#define FM_MTB_DWT_CMP_ADDR_STOP                  *((volatile uint32_t*)(0xF0001010UL))
#define FM0P_MTB_DWT_CMP_ADDR_STOP                *((volatile uint32_t*)(0xF0001010UL))
#define FM_MTB_DWT_CMP_DATA_STOP                  *((volatile uint32_t*)(0xF0001014UL))
#define FM0P_MTB_DWT_CMP_DATA_STOP                *((volatile uint32_t*)(0xF0001014UL))
#define FM_MTB_DWT_CMP_MASK_STOP                  *((volatile uint32_t*)(0xF0001018UL))
#define FM0P_MTB_DWT_CMP_MASK_STOP                *((volatile uint32_t*)(0xF0001018UL))
#define FM_MTB_DWT_FCT                            *((volatile  uint8_t*)(0xF0001020UL))
#define FM0P_MTB_DWT_FCT                          *((volatile  uint8_t*)(0xF0001020UL))
#define FM_MTB_DWT_PID4                           *((volatile uint32_t*)(0xF0001FD0UL))
#define FM0P_MTB_DWT_PID4                         *((volatile uint32_t*)(0xF0001FD0UL))
#define FM_MTB_DWT_PID5                           *((volatile uint32_t*)(0xF0001FD4UL))
#define FM0P_MTB_DWT_PID5                         *((volatile uint32_t*)(0xF0001FD4UL))
#define FM_MTB_DWT_PID6                           *((volatile uint32_t*)(0xF0001FD8UL))
#define FM0P_MTB_DWT_PID6                         *((volatile uint32_t*)(0xF0001FD8UL))
#define FM_MTB_DWT_PID7                           *((volatile uint32_t*)(0xF0001FDCUL))
#define FM0P_MTB_DWT_PID7                         *((volatile uint32_t*)(0xF0001FDCUL))
#define FM_MTB_DWT_PID0                           *((volatile uint32_t*)(0xF0001FE0UL))
#define FM0P_MTB_DWT_PID0                         *((volatile uint32_t*)(0xF0001FE0UL))
#define FM_MTB_DWT_PID1                           *((volatile uint32_t*)(0xF0001FE4UL))
#define FM0P_MTB_DWT_PID1                         *((volatile uint32_t*)(0xF0001FE4UL))
#define FM_MTB_DWT_PID2                           *((volatile uint32_t*)(0xF0001FE8UL))
#define FM0P_MTB_DWT_PID2                         *((volatile uint32_t*)(0xF0001FE8UL))
#define FM_MTB_DWT_PID3                           *((volatile uint32_t*)(0xF0001FECUL))
#define FM0P_MTB_DWT_PID3                         *((volatile uint32_t*)(0xF0001FECUL))
#define FM_MTB_DWT_CID0                           *((volatile uint32_t*)(0xF0001FF0UL))
#define FM0P_MTB_DWT_CID0                         *((volatile uint32_t*)(0xF0001FF0UL))
#define FM_MTB_DWT_CID1                           *((volatile uint32_t*)(0xF0001FF4UL))
#define FM0P_MTB_DWT_CID1                         *((volatile uint32_t*)(0xF0001FF4UL))
#define FM_MTB_DWT_CID2                           *((volatile uint32_t*)(0xF0001FF8UL))
#define FM0P_MTB_DWT_CID2                         *((volatile uint32_t*)(0xF0001FF8UL))
#define FM_MTB_DWT_CID3                           *((volatile uint32_t*)(0xF0001FFCUL))
#define FM0P_MTB_DWT_CID3                         *((volatile uint32_t*)(0xF0001FFCUL))

/*******************************************************************************
* QPRC Registers QPRC0
*   Register Definition
*******************************************************************************/
#define FM_QPRC0_QPCR                             *((volatile uint16_t*)(0x40026000UL))
#define FM0P_QPRC0_QPCR                           *((volatile uint16_t*)(0x40026000UL))
#define FM_QPRC0_QRCR                             *((volatile uint16_t*)(0x40026004UL))
#define FM0P_QPRC0_QRCR                           *((volatile uint16_t*)(0x40026004UL))
#define FM_QPRC0_QPCCR                            *((volatile uint16_t*)(0x40026008UL))
#define FM0P_QPRC0_QPCCR                          *((volatile uint16_t*)(0x40026008UL))
#define FM_QPRC0_QPRCR                            *((volatile uint16_t*)(0x4002600CUL))
#define FM0P_QPRC0_QPRCR                          *((volatile uint16_t*)(0x4002600CUL))
#define FM_QPRC0_QMPR                             *((volatile uint16_t*)(0x40026010UL))
#define FM0P_QPRC0_QMPR                           *((volatile uint16_t*)(0x40026010UL))
#define FM_QPRC0_QICRL                            *((volatile  uint8_t*)(0x40026014UL))
#define FM0P_QPRC0_QICRL                          *((volatile  uint8_t*)(0x40026014UL))
#define FM_QPRC0_QICRH                            *((volatile  uint8_t*)(0x40026015UL))
#define FM0P_QPRC0_QICRH                          *((volatile  uint8_t*)(0x40026015UL))
#define FM_QPRC0_QCR                              *((volatile uint16_t*)(0x40026018UL))
#define FM0P_QPRC0_QCR                            *((volatile uint16_t*)(0x40026018UL))
#define FM_QPRC0_QECR                             *((volatile uint16_t*)(0x4002601CUL))
#define FM0P_QPRC0_QECR                           *((volatile uint16_t*)(0x4002601CUL))
#define FM_QPRC0_QPRCRR                           *((volatile uint32_t*)(0x4002603CUL))
#define FM0P_QPRC0_QPRCRR                         *((volatile uint32_t*)(0x4002603CUL))

/*******************************************************************************
* QPRC_NF Registers QPRC0_NF
*   Register Definition
*******************************************************************************/
#define FM_QPRC0_NF_NFCTLA                        *((volatile uint16_t*)(0x40026100UL))
#define FM0P_QPRC0_NF_NFCTLA                      *((volatile uint16_t*)(0x40026100UL))
#define FM_QPRC0_NF_NFCTLB                        *((volatile uint16_t*)(0x40026104UL))
#define FM0P_QPRC0_NF_NFCTLB                      *((volatile uint16_t*)(0x40026104UL))
#define FM_QPRC0_NF_NFCTLZ                        *((volatile uint16_t*)(0x40026108UL))
#define FM0P_QPRC0_NF_NFCTLZ                      *((volatile uint16_t*)(0x40026108UL))

