MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A12C0AGV20000/mcu.h
/*******************************************************************************
* RTC Registers RTC
*   Register Definition
*******************************************************************************/
#define FM_RTC_WTCR1                              *((volatile uint32_t*)(0x4003B000UL))
#define FM0P_RTC_WTCR1                            *((volatile uint32_t*)(0x4003B000UL))
#define FM_RTC_WTCR2                              *((volatile uint32_t*)(0x4003B004UL))
#define FM0P_RTC_WTCR2                            *((volatile uint32_t*)(0x4003B004UL))
#define FM_RTC_WTBR                               *((volatile uint32_t*)(0x4003B008UL))
#define FM0P_RTC_WTBR                             *((volatile uint32_t*)(0x4003B008UL))
#define FM_RTC_WTSR                               *((volatile  uint8_t*)(0x4003B00CUL))
#define FM0P_RTC_WTSR                             *((volatile  uint8_t*)(0x4003B00CUL))
#define FM_RTC_WTMIR                              *((volatile  uint8_t*)(0x4003B00DUL))
#define FM0P_RTC_WTMIR                            *((volatile  uint8_t*)(0x4003B00DUL))
#define FM_RTC_WTHR                               *((volatile  uint8_t*)(0x4003B00EUL))
#define FM0P_RTC_WTHR                             *((volatile  uint8_t*)(0x4003B00EUL))
#define FM_RTC_WTDR                               *((volatile  uint8_t*)(0x4003B00FUL))
#define FM0P_RTC_WTDR                             *((volatile  uint8_t*)(0x4003B00FUL))
#define FM_RTC_WTDW                               *((volatile  uint8_t*)(0x4003B010UL))
#define FM0P_RTC_WTDW                             *((volatile  uint8_t*)(0x4003B010UL))
#define FM_RTC_WTMOR                              *((volatile  uint8_t*)(0x4003B011UL))
#define FM0P_RTC_WTMOR                            *((volatile  uint8_t*)(0x4003B011UL))
#define FM_RTC_WTYR                               *((volatile  uint8_t*)(0x4003B012UL))
#define FM0P_RTC_WTYR                             *((volatile  uint8_t*)(0x4003B012UL))
#define FM_RTC_ALMIR                              *((volatile  uint8_t*)(0x4003B015UL))
#define FM0P_RTC_ALMIR                            *((volatile  uint8_t*)(0x4003B015UL))
#define FM_RTC_ALHR                               *((volatile  uint8_t*)(0x4003B016UL))
#define FM0P_RTC_ALHR                             *((volatile  uint8_t*)(0x4003B016UL))
#define FM_RTC_ALDR                               *((volatile  uint8_t*)(0x4003B017UL))
#define FM0P_RTC_ALDR                             *((volatile  uint8_t*)(0x4003B017UL))
#define FM_RTC_ALMOR                              *((volatile  uint8_t*)(0x4003B019UL))
#define FM0P_RTC_ALMOR                            *((volatile  uint8_t*)(0x4003B019UL))
#define FM_RTC_ALYR                               *((volatile  uint8_t*)(0x4003B01AUL))
#define FM0P_RTC_ALYR                             *((volatile  uint8_t*)(0x4003B01AUL))
#define FM_RTC_WTTR                               *((volatile uint32_t*)(0x4003B01CUL))
#define FM0P_RTC_WTTR                             *((volatile uint32_t*)(0x4003B01CUL))
#define FM_RTC_WTCLKS                             *((volatile  uint8_t*)(0x4003B020UL))
#define FM0P_RTC_WTCLKS                           *((volatile  uint8_t*)(0x4003B020UL))
#define FM_RTC_WTCLKM                             *((volatile  uint8_t*)(0x4003B021UL))
#define FM0P_RTC_WTCLKM                           *((volatile  uint8_t*)(0x4003B021UL))
#define FM_RTC_WTCAL                              *((volatile uint16_t*)(0x4003B024UL))
#define FM0P_RTC_WTCAL                            *((volatile uint16_t*)(0x4003B024UL))
#define FM_RTC_WTCALEN                            *((volatile  uint8_t*)(0x4003B026UL))
#define FM0P_RTC_WTCALEN                          *((volatile  uint8_t*)(0x4003B026UL))
#define FM_RTC_WTDIV                              *((volatile  uint8_t*)(0x4003B028UL))
#define FM0P_RTC_WTDIV                            *((volatile  uint8_t*)(0x4003B028UL))
#define FM_RTC_WTDIVEN                            *((volatile  uint8_t*)(0x4003B029UL))
#define FM0P_RTC_WTDIVEN                          *((volatile  uint8_t*)(0x4003B029UL))
#define FM_RTC_WTCALPRD                           *((volatile  uint8_t*)(0x4003B02CUL))
#define FM0P_RTC_WTCALPRD                         *((volatile  uint8_t*)(0x4003B02CUL))
#define FM_RTC_WTCOSEL                            *((volatile  uint8_t*)(0x4003B030UL))
#define FM0P_RTC_WTCOSEL                          *((volatile  uint8_t*)(0x4003B030UL))

/*******************************************************************************
* SBSSR Registers SBSSR
*   Register Definition
*******************************************************************************/
#define FM_SBSSR_BTSSSR                           *((volatile uint16_t*)(0x40025FFCUL))
#define FM0P_SBSSR_BTSSSR                         *((volatile uint16_t*)(0x40025FFCUL))

/*******************************************************************************
* SWWDT Registers SWWDT
*   Register Definition
*******************************************************************************/
#define FM_SWWDT_WDOGLOAD                         *((volatile uint32_t*)(0x40012000UL))
#define FM0P_SWWDT_WDOGLOAD                       *((volatile uint32_t*)(0x40012000UL))
#define FM_SWWDT_WDOGVALUE                        *((volatile uint32_t*)(0x40012004UL))
#define FM0P_SWWDT_WDOGVALUE                      *((volatile uint32_t*)(0x40012004UL))
#define FM_SWWDT_WDOGCONTROL                      *((volatile uint32_t*)(0x40012008UL))
#define FM0P_SWWDT_WDOGCONTROL                    *((volatile uint32_t*)(0x40012008UL))
#define FM_SWWDT_WDOGINTCLR                       *((volatile uint32_t*)(0x4001200CUL))
#define FM0P_SWWDT_WDOGINTCLR                     *((volatile uint32_t*)(0x4001200CUL))
#define FM_SWWDT_WDOGRIS                          *((volatile uint32_t*)(0x40012010UL))
#define FM0P_SWWDT_WDOGRIS                        *((volatile uint32_t*)(0x40012010UL))
#define FM_SWWDT_WDOGSPMC                         *((volatile uint32_t*)(0x40012018UL))
#define FM0P_SWWDT_WDOGSPMC                       *((volatile uint32_t*)(0x40012018UL))
#define FM_SWWDT_WDOGLOCK                         *((volatile uint32_t*)(0x40012C00UL))
#define FM0P_SWWDT_WDOGLOCK                       *((volatile uint32_t*)(0x40012C00UL))

