MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A12C0AGV20000/mcu.h
#define bFM_GPIO_PDIR3_P9                         *((volatile  uint8_t *)(0x426661A4UL))
#define bFM0P_GPIO_PDIR3_P9                       *((volatile  uint8_t *)(0x426661A4UL))
#define bFM_GPIO_PDIR3_PA                         *((volatile  uint8_t *)(0x426661A8UL))
#define bFM0P_GPIO_PDIR3_PA                       *((volatile  uint8_t *)(0x426661A8UL))
#define bFM_GPIO_PDIR3_PB                         *((volatile  uint8_t *)(0x426661ACUL))
#define bFM0P_GPIO_PDIR3_PB                       *((volatile  uint8_t *)(0x426661ACUL))
#define bFM_GPIO_PDIR3_PC                         *((volatile  uint8_t *)(0x426661B0UL))
#define bFM0P_GPIO_PDIR3_PC                       *((volatile  uint8_t *)(0x426661B0UL))
#define bFM_GPIO_PDIR3_PD                         *((volatile  uint8_t *)(0x426661B4UL))
#define bFM0P_GPIO_PDIR3_PD                       *((volatile  uint8_t *)(0x426661B4UL))
#define bFM_GPIO_PDIR3_PE                         *((volatile  uint8_t *)(0x426661B8UL))
#define bFM0P_GPIO_PDIR3_PE                       *((volatile  uint8_t *)(0x426661B8UL))
#define bFM_GPIO_PDIR3_PF                         *((volatile  uint8_t *)(0x426661BCUL))
#define bFM0P_GPIO_PDIR3_PF                       *((volatile  uint8_t *)(0x426661BCUL))

#define bFM_GPIO_PDIR4_P6                         *((volatile  uint8_t *)(0x42666218UL))
#define bFM0P_GPIO_PDIR4_P6                       *((volatile  uint8_t *)(0x42666218UL))
#define bFM_GPIO_PDIR4_P7                         *((volatile  uint8_t *)(0x4266621CUL))
#define bFM0P_GPIO_PDIR4_P7                       *((volatile  uint8_t *)(0x4266621CUL))
#define bFM_GPIO_PDIR4_P9                         *((volatile  uint8_t *)(0x42666224UL))
#define bFM0P_GPIO_PDIR4_P9                       *((volatile  uint8_t *)(0x42666224UL))
#define bFM_GPIO_PDIR4_PA                         *((volatile  uint8_t *)(0x42666228UL))
#define bFM0P_GPIO_PDIR4_PA                       *((volatile  uint8_t *)(0x42666228UL))

#define bFM_GPIO_PDIR5_P0                         *((volatile  uint8_t *)(0x42666280UL))
#define bFM0P_GPIO_PDIR5_P0                       *((volatile  uint8_t *)(0x42666280UL))
#define bFM_GPIO_PDIR5_P1                         *((volatile  uint8_t *)(0x42666284UL))
#define bFM0P_GPIO_PDIR5_P1                       *((volatile  uint8_t *)(0x42666284UL))
#define bFM_GPIO_PDIR5_P2                         *((volatile  uint8_t *)(0x42666288UL))
#define bFM0P_GPIO_PDIR5_P2                       *((volatile  uint8_t *)(0x42666288UL))

#define bFM_GPIO_PDIR6_P0                         *((volatile  uint8_t *)(0x42666300UL))
#define bFM0P_GPIO_PDIR6_P0                       *((volatile  uint8_t *)(0x42666300UL))
#define bFM_GPIO_PDIR6_P1                         *((volatile  uint8_t *)(0x42666304UL))
#define bFM0P_GPIO_PDIR6_P1                       *((volatile  uint8_t *)(0x42666304UL))

#define bFM_GPIO_PDIR8_P0                         *((volatile  uint8_t *)(0x42666400UL))
#define bFM0P_GPIO_PDIR8_P0                       *((volatile  uint8_t *)(0x42666400UL))
#define bFM_GPIO_PDIR8_P1                         *((volatile  uint8_t *)(0x42666404UL))
#define bFM0P_GPIO_PDIR8_P1                       *((volatile  uint8_t *)(0x42666404UL))
#define bFM_GPIO_PDIR8_P2                         *((volatile  uint8_t *)(0x42666408UL))
#define bFM0P_GPIO_PDIR8_P2                       *((volatile  uint8_t *)(0x42666408UL))

#define bFM_GPIO_PDIRE_P0                         *((volatile  uint8_t *)(0x42666700UL))
#define bFM0P_GPIO_PDIRE_P0                       *((volatile  uint8_t *)(0x42666700UL))
#define bFM_GPIO_PDIRE_P2                         *((volatile  uint8_t *)(0x42666708UL))
#define bFM0P_GPIO_PDIRE_P2                       *((volatile  uint8_t *)(0x42666708UL))
#define bFM_GPIO_PDIRE_P3                         *((volatile  uint8_t *)(0x4266670CUL))
#define bFM0P_GPIO_PDIRE_P3                       *((volatile  uint8_t *)(0x4266670CUL))

#define bFM_GPIO_PDOR0_P0                         *((volatile  uint8_t *)(0x42668000UL))
#define bFM0P_GPIO_PDOR0_P0                       *((volatile  uint8_t *)(0x42668000UL))
#define bFM_GPIO_PDOR0_P1                         *((volatile  uint8_t *)(0x42668004UL))
#define bFM0P_GPIO_PDOR0_P1                       *((volatile  uint8_t *)(0x42668004UL))
#define bFM_GPIO_PDOR0_P2                         *((volatile  uint8_t *)(0x42668008UL))
#define bFM0P_GPIO_PDOR0_P2                       *((volatile  uint8_t *)(0x42668008UL))
#define bFM_GPIO_PDOR0_P3                         *((volatile  uint8_t *)(0x4266800CUL))
#define bFM0P_GPIO_PDOR0_P3                       *((volatile  uint8_t *)(0x4266800CUL))
#define bFM_GPIO_PDOR0_P4                         *((volatile  uint8_t *)(0x42668010UL))
#define bFM0P_GPIO_PDOR0_P4                       *((volatile  uint8_t *)(0x42668010UL))
#define bFM_GPIO_PDOR0_PF                         *((volatile  uint8_t *)(0x4266803CUL))
#define bFM0P_GPIO_PDOR0_PF                       *((volatile  uint8_t *)(0x4266803CUL))

#define bFM_GPIO_PDOR1_P0                         *((volatile  uint8_t *)(0x42668080UL))
#define bFM0P_GPIO_PDOR1_P0                       *((volatile  uint8_t *)(0x42668080UL))
#define bFM_GPIO_PDOR1_P1                         *((volatile  uint8_t *)(0x42668084UL))
#define bFM0P_GPIO_PDOR1_P1                       *((volatile  uint8_t *)(0x42668084UL))
#define bFM_GPIO_PDOR1_P2                         *((volatile  uint8_t *)(0x42668088UL))
#define bFM0P_GPIO_PDOR1_P2                       *((volatile  uint8_t *)(0x42668088UL))
#define bFM_GPIO_PDOR1_P3                         *((volatile  uint8_t *)(0x4266808CUL))
#define bFM0P_GPIO_PDOR1_P3                       *((volatile  uint8_t *)(0x4266808CUL))
#define bFM_GPIO_PDOR1_P4                         *((volatile  uint8_t *)(0x42668090UL))
#define bFM0P_GPIO_PDOR1_P4                       *((volatile  uint8_t *)(0x42668090UL))
#define bFM_GPIO_PDOR1_P5                         *((volatile  uint8_t *)(0x42668094UL))
#define bFM0P_GPIO_PDOR1_P5                       *((volatile  uint8_t *)(0x42668094UL))

#define bFM_GPIO_PDOR2_P1                         *((volatile  uint8_t *)(0x42668104UL))
#define bFM0P_GPIO_PDOR2_P1                       *((volatile  uint8_t *)(0x42668104UL))
#define bFM_GPIO_PDOR2_P2                         *((volatile  uint8_t *)(0x42668108UL))
#define bFM0P_GPIO_PDOR2_P2                       *((volatile  uint8_t *)(0x42668108UL))
#define bFM_GPIO_PDOR2_P3                         *((volatile  uint8_t *)(0x4266810CUL))
#define bFM0P_GPIO_PDOR2_P3                       *((volatile  uint8_t *)(0x4266810CUL))

#define bFM_GPIO_PDOR3_P9                         *((volatile  uint8_t *)(0x426681A4UL))
#define bFM0P_GPIO_PDOR3_P9                       *((volatile  uint8_t *)(0x426681A4UL))
#define bFM_GPIO_PDOR3_PA                         *((volatile  uint8_t *)(0x426681A8UL))
#define bFM0P_GPIO_PDOR3_PA                       *((volatile  uint8_t *)(0x426681A8UL))
#define bFM_GPIO_PDOR3_PB                         *((volatile  uint8_t *)(0x426681ACUL))
#define bFM0P_GPIO_PDOR3_PB                       *((volatile  uint8_t *)(0x426681ACUL))
#define bFM_GPIO_PDOR3_PC                         *((volatile  uint8_t *)(0x426681B0UL))
#define bFM0P_GPIO_PDOR3_PC                       *((volatile  uint8_t *)(0x426681B0UL))
#define bFM_GPIO_PDOR3_PD                         *((volatile  uint8_t *)(0x426681B4UL))
#define bFM0P_GPIO_PDOR3_PD                       *((volatile  uint8_t *)(0x426681B4UL))
#define bFM_GPIO_PDOR3_PE                         *((volatile  uint8_t *)(0x426681B8UL))
#define bFM0P_GPIO_PDOR3_PE                       *((volatile  uint8_t *)(0x426681B8UL))
#define bFM_GPIO_PDOR3_PF                         *((volatile  uint8_t *)(0x426681BCUL))
#define bFM0P_GPIO_PDOR3_PF                       *((volatile  uint8_t *)(0x426681BCUL))

#define bFM_GPIO_PDOR4_P6                         *((volatile  uint8_t *)(0x42668218UL))
#define bFM0P_GPIO_PDOR4_P6                       *((volatile  uint8_t *)(0x42668218UL))
#define bFM_GPIO_PDOR4_P7                         *((volatile  uint8_t *)(0x4266821CUL))
#define bFM0P_GPIO_PDOR4_P7                       *((volatile  uint8_t *)(0x4266821CUL))
#define bFM_GPIO_PDOR4_P9                         *((volatile  uint8_t *)(0x42668224UL))
#define bFM0P_GPIO_PDOR4_P9                       *((volatile  uint8_t *)(0x42668224UL))
#define bFM_GPIO_PDOR4_PA                         *((volatile  uint8_t *)(0x42668228UL))
#define bFM0P_GPIO_PDOR4_PA                       *((volatile  uint8_t *)(0x42668228UL))

